СРО_Копия/src/Reports/СРО_ПроверкаОтчетностиСРассылкойПисем/СРО_ПроверкаОтчетностиСРассылкойПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_ПроверкаОтчетностиСРассылкойПисем</name>
  <attributes>
    <name>ОтчетностьСРО</name>
    <type>
      <types>DocumentRef.ОтчетностьКПК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаОшибок</name>
    <attributes>
      <name>КПК</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОшибок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРеестреСРО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

СРО_Копия/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииКПК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРеестреСРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсключенияИзСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.СРО_Субъекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеГУ</name>
    <type>
      <types>CatalogRef.СРО_УправленияГУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияБанкротство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ДатаНачалаПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_ПроверкаОтчетностиСРассылкойПисем/Forms/ФормаОтбораПоСписку/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВремТаблицаДляРассылки = Параметры.ТаблицаДляРассылки;
	//
	//НомерПоПорядку = 0;
	//
	//Для Каждого ТекСтрока ИЗ ВремТаблицаДляРассылки Цикл
	//	НомерПоПорядку = НомерПоПорядку + 1;
	//	
	//	НоваяСтрока = ТаблицаДляРассылки.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	//	НоваяСтрока.НомерПоПорядку = НомерПоПорядку;
	//	
	//КонецЦикла;
	//
	//ВремТаблицаДляРассылкиКопия = РеквизитФормыВЗначение("ТаблицаДляРассылкиКопия");
	//
	//Для Каждого ТекСтрока из ТаблицаДляРассылки ЦИкл
	//	НоваяСтрока =  ВремТаблицаДляРассылкиКопия.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(ВремТаблицаДляРассылкиКопия, "ТаблицаДляРассылкиКопия");


КонецПроцедуры

&НаСервере
Процедура ОтметитьПоТаблицеНаСервере()
	ИтогоОтмечено = 0;
	Для НомерСтроки = 1 по 10000 Цикл   		
		
		НомерВРеестреСРО = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(1,"ЧГ=")).Текст);
		КПКНаименование = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		КПКИНН = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст);		
		КПКОГРН = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст);			
		
		Если КПКНаименование = "" И КПКИНН = "" И КПКОГРН = "" Тогда
			Прервать;
		КонецЕсли;

				
		КПК = Неопределено;
		
		СтруктураПоискаКПК = Новый Структура;
		СтруктураПоискаКПК.Вставить("КПКИНН", КПКИНН);
		СтруктураПоискаКПК.Вставить("КПКОГРН", КПКОГРН);
		СтруктураПоискаКПК.Вставить("НомерВРеестреСРО", НомерВРеестреСРО); 		
		
		НайденКПК  = СРО_ЗагрузкаОтчетности.НайтиКПК(СтруктураПоискаКПК, КПК);
		
		Если КПК = Неопределено Тогда                                                            			
			Сообщить("Не найден КПК " + КПКНаименование + " ИНН " + КПКИНН + " ОГРН " + КПКОГРН);
			Продолжить;			
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаДляРассылки.НайтиСтроки(Новый Структура("КПК", КПК));		

		Если НайденныеСтроки.Количество() =0 Тогда 
			Сообщить(НомерВРеестреСРО + " " + КПКНаименование + " ИНН " + КПКИНН + " ОГРН " + КПКОГРН + " не найден в отчете");
			Продолжить;
		КонецЕсли;
		
		ИтогоОтмечено = ИтогоОтмечено + 1;
		НайденнаяСтрока = НайденныеСтроки[0];
		НайденнаяСтрока.Флаг = Истина;
		
	КонецЦикла;;
	
	Сообщить("Итого отмечено: " + Строка(ИтогоОтмечено));
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПоТаблице(Команда)
	ОтметитьПоТаблицеНаСервере();
КонецПроцедуры

&НаСервере

Функция ПолучитьМассивОтмеченныхКПК()
	
	МассивКПК = Новый Массив;
	
	НайденныеСтроки = ТаблицаДляРассылки.НайтиСтроки(Новый Структура("Флаг", Истина));
	
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		МассивКПК.Добавить(ТекСтрока.КПК);
	КонецЦикла;
	
	Возврат МассивКПК;
	
КонецФункции

&НаКлиенте
Процедура Завершить(Команда)
	
	МассивКПК = ПолучитьМассивОтмеченныхКПК();
	ОповеститьОВыборе(МассивКПК);
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КПК,
	|	Контрагенты.НомерВРеестреСРО КАК НомерВРеестреСРО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ДатаИсключенияИзСРО = &ПустаяДата
	|	И Контрагенты.ДатаВступленияВСРО <> &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.НомерВРеестреСРО";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;	
	
КонецФункции


&НаСервере
Процедура ВыводитьВсеКПКПриИзмененииНаСервере()
	Если ВыводитьВсеКПК Тогда
		
		РезультатЗапроса = ПолучитьРезультатЗапроса();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ТаблицаДляРассылки.Очистить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			НомерПоПорядку = 0;
			
			ПОка Выборка.Следующий() Цикл
				
				НомерПоПорядку = НомерПоПорядку + 1;
				
				НоваяСтрока = ТаблицаДляРассылки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.НомерПоПорядку = НомерПоПорядку;
				
			КонецЦикла;    			
			
			ВремТаблицаДляРассылки = РеквизитФормыВЗначение("ТаблицаДляРассылки");
			
			НайденныеСтроки = ТаблицаДляРассылкиКопия.НайтиСтроки(НОвый СТруктура("Флаг", Истина)); 
			
			Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
				НайденныеСтрокиРассылки = ВремТаблицаДляРассылки.НайтиСтроки(НОвый СТруктура("КПК", НайденнаяСтрока.КПК)); 
				
				Для каждого НайденнаяСтрокаРассылки ИЗ НайденныеСтрокиРассылки цикл
					НайденнаяСтрокаРассылки.Флаг = Истина;
				КонецЦикла;

			КонецЦикла;           
			
			ЗначениеВРеквизитФормы(ВремТаблицаДляРассылки, "ТаблицаДляРассылки");  		

		КонецЕсли; 	
		
	Иначе
		
		ВремТаблицаДляРассылки = РеквизитФормыВЗначение("ТаблицаДляРассылки");
		ВремТаблицаДляРассылки.Очистить();
	
		Для Каждого ТекСтрока из ТаблицаДляРассылкиКопия ЦИкл
			НоваяСтрока =  ВремТаблицаДляРассылки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ВремТаблицаДляРассылки, "ТаблицаДляРассылки"); 
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВсеКПКПриИзменении(Элемент)
	ВыводитьВсеКПКПриИзмененииНаСервере();
КонецПроцедуры
